burgrp/py32-svd/svd/py32md320xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP1</name>
      <description>Comparator</description>
      <groupName>COMP</groupName>
      <baseAddress>0x40010200</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CSR</name>
          <displayName>CSR</displayName>
          <description>COMP control and status register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>COMP_EN</name>
              <description>COMP enable bit</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SCALER_EN</name>
              <description>SCALER enable bit</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>INMSEL</name>
              <description>Comparator signal selector forinverting input INM</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>INPSEL</name>
              <description>Comparator signal selector fornon-inverting input</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>WINMODE</name>
              <description>Comparator non-inverting inputselector for window mode</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>POLARITY</name>
              <description>Comparator polarityselector</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>HYST</name>
              <description>Comparator hysteresis enableselector</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>PWRMODE</name>
              <description>Comparator power modeselector</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>COMP_OUT</name>
              <description>Comparator output status</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>LOCK</name>
              <description>CSR register lock</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FR</name>
          <displayName>FR</displayName>
          <description>Comparator Filterregister</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>FLTEN</name>
              <description>Filter enable bit</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FLTCNT</name>
              <description>Comparator filter and counter</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP2</name>
      <description>Comparator</description>
      <groupName>COMP</groupName>
      <baseAddress>0x40010210</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CSR</name>
          <displayName>CSR</displayName>
          <description>COMP control and status register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>COMP_EN</name>
              <description>COMP enable bit</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>INMSEL</name>
              <description>Comparator signal selector forinverting input INM</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>INPSEL</name>
              <description>Comparator signal selector fornon-inverting input</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>WINMODE</name>
              <description>Comparator non-inverting inputselector for window mode</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>POLARITY</name>
              <description>Comparator polarityselector</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>PWRMODE</name>
              <description>Comparator power modeselector</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>COMP_OUT</name>
              <description>Comparator output status</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>LOCK</name>
              <description>CSR register lock</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FR</name>
          <displayName>FR</displayName>
          <description>Comparator Filterregister</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>FLTEN</name>
              <description>Filter enable bit</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FLTCNT</name>
              <description>Comparator filter and counter</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
