burgrp/py32-svd/svd/py32md320xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RCC</name>
      <description>Reset and clock control</description>
      <groupName>RCC</groupName>
      <baseAddress>0x40021000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RCC</name>
        <description>RCC global Interrupt</description>
        <value>4</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>Clock control register</description>
          <addressOffset>0x0</addressOffset>
          <resetValue>0x100</resetValue>
          <fields>
            <field>
              <name>HSION</name>
              <description>HSI16 clock enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>HSIKERON</name>
              <description>HSI16 always enable for peripheralkernels</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>HSIRDY</name>
              <description>HSI16 clock ready flag</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>HSIDIV</name>
              <description>HSI16 clock divisionfactor</description>
              <bitRange>[13:11]</bitRange>
            </field>
            <field>
              <name>HSEON</name>
              <description>HSE clock enable</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>HSERDY</name>
              <description>HSE clock ready flag</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>HSEBYP</name>
              <description>HSE crystal oscillatorbypass</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CSSON</name>
              <description>Clock security systemenable</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>PLLON</name>
              <description>PLL enable</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>PLLRDY</name>
              <description>PLL clock ready flag</description>
              <bitRange>[25:25]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ICSCR</name>
          <displayName>ICSCR</displayName>
          <description>Internal clock sources calibrationregister</description>
          <addressOffset>0x4</addressOffset>
          <resetValue>0x10000000</resetValue>
          <fields>
            <field>
              <name>HSI_TRIM</name>
              <description>HSI clock trimming</description>
              <bitRange>[12:0]</bitRange>
            </field>
            <field>
              <name>HSI_FS</name>
              <description>HSI frequency selection</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>LSI_TRIM</name>
              <description>LSI clock trimming</description>
              <bitRange>[24:16]</bitRange>
            </field>
            <field>
              <name>LSI_STARTUP</name>
              <description>LSI startup time</description>
              <bitRange>[27:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR</name>
          <displayName>CFGR</displayName>
          <description>Clock configuration register</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>SW</name>
              <description>System clock switch</description>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>SWS</name>
              <description>System clock switch status</description>
              <bitRange>[5:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HPRE</name>
              <description>AHB prescaler</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>PPRE</name>
              <description>APB prescaler</description>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>MCOSEL</name>
              <description>Microcontroller clockoutput</description>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>MCOPRE</name>
              <description>Microcontroller clock outputprescaler</description>
              <bitRange>[30:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLCFGR</name>
          <displayName>PLLCFGR</displayName>
          <description>PLL configuration register</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>PLLSRC</name>
              <description>PLL clock source selection</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ECSCR</name>
          <displayName>ECSCR</displayName>
          <description>External clock source control register</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>HSE_FREQ</name>
              <description>HSE clock freqency selection</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>LSE_DRIVER</name>
              <description>LSE clock driver selection</description>
              <bitRange>[17:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CIER</name>
          <displayName>CIER</displayName>
          <description>Clock interrupt enableregister</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>LSIRDYIE</name>
              <description>LSI ready interrupt enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LSERDYIE</name>
              <description>LSE ready interrupt enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HSIRDYIE</name>
              <description>HSI ready interrupt enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>HSERDYIE</name>
              <description>HSE ready interrupt enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PLLRDYIE</name>
              <description>PLL ready interrupt enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CIFR</name>
          <displayName>CIFR</displayName>
          <description>Clock interrupt flag register</description>
          <addressOffset>0x1C</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>LSIRDYF</name>
              <description>LSI ready interrupt flag</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LSERDYF</name>
              <description>LSE ready interrupt flag</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HSIRDYF</name>
              <description>HSI ready interrupt flag</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>HSERDYF</name>
              <description>HSE ready interrupt flag</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PLLRDYF</name>
              <description>PLL ready interrupt flag</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CSSF</name>
              <description>HSE clock secure system interrupt flag</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LSECSSF</name>
              <description>LSE clock secure system interrupt flag</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CICR</name>
          <displayName>CICR</displayName>
          <description>Clock interrupt clear register</description>
          <addressOffset>0x20</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>LSIRDYC</name>
              <description>LSI ready interrupt clear</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LSERDYC</name>
              <description>LSE ready interrupt clear</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HSIRDYC</name>
              <description>HSI ready interrupt clear</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>HSERDYC</name>
              <description>HSE ready interrupt clear</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PLLRDYC</name>
              <description>PLL ready interrupt clear</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CSSC</name>
              <description>clock secure system interrupt flag clear</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LSECSSC</name>
              <description>LSE clock secure system interrupt flag clear</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOPRSTR</name>
          <displayName>IOPRSTR</displayName>
          <description>GPIO reset register</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>GPIOARST</name>
              <description>I/O port A reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GPIOBRST</name>
              <description>I/O port B reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GPIOFRST</name>
              <description>I/O port F reset</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBRSTR</name>
          <displayName>AHBRSTR</displayName>
          <description>AHB peripheral reset register</description>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>DMARST</name>
              <description>DMA reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CRCRST</name>
              <description>CRC reset</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APBRSTR1</name>
          <displayName>APBRSTR1</displayName>
          <description>APB peripheral reset register1</description>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>TIM3RST</name>
              <description>TIM3 timer reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SPI2RST</name>
              <description>SPI2 reset</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>USART2RST</name>
              <description>USART2 reset</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>I2CRST</name>
              <description>I2C reset</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>DBGRST</name>
              <description>Debug support reset</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>PWRRST</name>
              <description>Power interface reset</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>LPTIMRST</name>
              <description>Low Power Timer reset</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APBRSTR2</name>
          <displayName>APBRSTR2</displayName>
          <description>APB peripheral reset register2</description>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>SYSCFGRST</name>
              <description>SYSCFG and COMPreset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TIM1RST</name>
              <description>TIM1 timer reset</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SPI1RST</name>
              <description>SPI1 reset</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>USART1RST</name>
              <description>USART1 reset</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TIM14RST</name>
              <description>TIM14 timer reset</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>TIM16RST</name>
              <description>TIM16 timer reset</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>TIM17RST</name>
              <description>TIM17 timer reset</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADCRST</name>
              <description>ADC reset</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>COMP1RST</name>
              <description>COMP1 reset</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>COMP2RST</name>
              <description>COMP2 reset</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>LEDRST</name>
              <description>LED reset</description>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOPENR</name>
          <displayName>IOPENR</displayName>
          <description>GPIO clock enable register</description>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>GPIOAEN</name>
              <description>I/O port A clock enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GPIOBEN</name>
              <description>I/O port B clock enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GPIOFEN</name>
              <description>I/O port F clock enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBENR</name>
          <displayName>AHBENR</displayName>
          <description>AHB peripheral clock enableregister</description>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>DMAEN</name>
              <description>DMA clock enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FLASHEN</name>
              <description>Flash memory interface clockenable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SRAMEN</name>
              <description>SRAM memory interface clockenable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CRCEN</name>
              <description>CRC clock enable</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APBENR1</name>
          <displayName>APBENR1</displayName>
          <description>APB peripheral clock enable register1</description>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>TIM3EN</name>
              <description>TIM3 timer clock enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RTCAPBEN</name>
              <description>RTC APB clock enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>WWDGEN</name>
              <description>WWDG clock enable</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SPI2EN</name>
              <description>SPI2 clock enable</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>USART2EN</name>
              <description>USART2 clock enable</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>I2CEN</name>
              <description>I2C clock enable</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>DBGEN</name>
              <description>Debug support clock enable</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>PWREN</name>
              <description>Power interface clockenable</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>LPTIMEN</name>
              <description>LPTIM clock enable</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APBENR2</name>
          <displayName>APBENR2</displayName>
          <description>APB peripheral clock enable register2</description>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>SYSCFGEN</name>
              <description>SYSCFG, COMP and VREFBUF clockenable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TIM1EN</name>
              <description>TIM1 timer clock enable</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SPI1EN</name>
              <description>SPI1 clock enable</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>USART1EN</name>
              <description>USART1 clock enable</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TIM14EN</name>
              <description>TIM14 timer clock enable</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>TIM16EN</name>
              <description>TIM16 timer clock enable</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>TIM17EN</name>
              <description>TIM16 timer clock enable</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADCEN</name>
              <description>ADC clock enable</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>COMP1EN</name>
              <description>COMP1 clock enable</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>COMP2EN</name>
              <description>COMP2 clock enable</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>LEDEN</name>
              <description>LED clock enable</description>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCIPR</name>
          <displayName>CCIPR</displayName>
          <description>Peripherals independent clock configurationregister</description>
          <addressOffset>0x54</addressOffset>
          <fields>
            <field>
              <name>PVDSEL</name>
              <description>PVD detect clock sourceselection</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>COMP1SEL</name>
              <description>COMP1 clock sourceselection</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>COMP2SEL</name>
              <description>COMP2 clock sourceselection</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LPTIM1SEL</name>
              <description>LPTIM1 clock sourceselection</description>
              <bitRange>[19:18]</bitRange>
            </field>
          </fields>
        </register>
