burgrp/py32-svd/svd/py32md320xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SPI2</name>
      <baseAddress>0x40003800</baseAddress>
      <interrupt>
        <name>SPI2</name>
        <description>SPI2 global Interrupt</description>
        <value>26</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>SYSCFG</name>
      <description>System configuration controller</description>
      <groupName>SYSCFG</groupName>
      <baseAddress>0x40010000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CFGR1</name>
          <displayName>CFGR1</displayName>
          <description>SYSCFG configuration register1</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>MEM_MODE</name>
              <description>Memory mapping selectionbits</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>I2C_PA2_ANF</name>
              <description>Analog filter enable control driving capabilityactivation bits PA2</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>I2C_PA3_ANF</name>
              <description>Analog filter enable control driving capabilityactivation bits PA3</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>I2C_PA7_ANF</name>
              <description>Analog filter enable control driving capabilityactivation bits PA7</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>I2C_PA8_ANF</name>
              <description>Analog filter enable control driving capabilityactivation bits PA8</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>I2C_PA9_ANF</name>
              <description>Analog filter enable control driving capabilityactivation bits PA9</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>I2C_PA10_ANF</name>
              <description>Analog filter enable control driving capabilityactivation bits PA10</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>I2C_PA11_ANF</name>
              <description>Analog filter enable control driving capabilityactivation bits PA11</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>I2C_PA12_ANF</name>
              <description>Analog filter enable control driving capabilityactivation bits PA12</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>I2C_PB6_ANF</name>
              <description>Analog filter enable control driving capabilityactivation bits PB6</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>I2C_PB7_ANF</name>
              <description>Analog filter enable control driving capabilityactivation bits PB7</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>I2C_PB8_ANF</name>
              <description>Analog filter enable control driving capabilityactivation bits PB8</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>I2C_PF0_ANF</name>
              <description>Analog filter enable control driving capabilityactivation bits PF0</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>I2C_PF1_ANF</name>
              <description>Analog filter enable control driving capabilityactivation bits PF1</description>
              <bitRange>[30:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR2</name>
          <displayName>CFGR2</displayName>
          <description>SYSCFG configuration register2</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>LOCKUP_LOCK</name>
              <description>Cortex-M0+ LOCKUP bit enablebit</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PVD_LOCK</name>
              <description>PVD lock enable bit</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>COMP1_BRK_TIM1</name>
              <description>COMP1 is enable to input of TIM1 break</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>COMP2_BRK_TIM1</name>
              <description>COMP2 is enable to input of TIM1 break</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>COMP1_BRK_TIM16</name>
              <description>COMP1 is enable to input of TIM16 break</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>COMP2_BRK_TIM16</name>
              <description>COMP2 is enable to input of TIM16 break</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>COMP1_BRK_TIM17</name>
              <description>COMP1 is enable to input of TIM17 break</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>COMP2_BRK_TIM17</name>
              <description>COMP2 is enable to input of TIM17 break</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ETR_SRC_TIM1</name>
              <description>TIM1 ETR source selection</description>
              <bitRange>[10:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR3</name>
          <displayName>CFGR3</displayName>
          <description>SYSCFG configuration register3</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>DMA1_MAP</name>
              <description>DMA channel1 requeset selection</description>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>DMA2_MAP</name>
              <description>DMA channel2 requeset selection</description>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>DMA3_MAP</name>
              <description>DMA channel3 requeset selection</description>
              <bitRange>[20:16]</bitRange>
            </field>
          </fields>
        </register>
